In [59]:
import pandas as pd

In [63]:
df_co2 = pd.read_csv('co2_em.csv')
df_co2.head()

   Year    co2_em
0  1960  3641.331
1  1961  3777.010
2  1962  3080.280
3  1963  3960.360
4  1964  4422.402

In [65]:
df_co2.dtypes # search the type of the data we have in the csv file so that we convert it if it is needed

Year        int64
co2_em    float64
dtype: object

In [66]:
df_co2.isna().sum()

Year      0
co2_em    2
dtype: int64

In [67]:
df_co2  = df_co2.dropna()
df_co2.head()

   Year    co2_em
0  1960  3641.331
1  1961  3777.010
2  1962  3080.280
3  1963  3960.360
4  1964  4422.402